Tekla Open API Reference for Tekla Structures 2025
String Operators and Type Conversions
The String type exposes the following members.
Operators
Name | Description
Equality
 Compares a string value with a Datatype.String value.
Implicit(String to String)
 Converts from string to Datatype.String.
Implicit(String to String)
 Converts from Datatype.String to string.
Inequality
 Compares a string value with a Datatype.String value.
Top
See Also
Reference
String Structure
Tekla.Structures.Datatype Namespace